# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Zsh prompt for Astronauts
brew "spaceship"
# Terminal multiplexer
brew "tmux"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Lazier way to manage everything docker
brew "lazydocker"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Official Amazon AWS command-line interface
brew "awscli"
# Thin wrapper around the `aws` command-line interface for use with LocalStack
brew "awscli-local"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Lazier way to manage everything docker
brew "lazydocker"
# Package manager for the Lua programming language
brew "luarocks"
